using System;
using System.Threading;
using System.Threading.Tasks;

class Program
{
    static void Main(string[] Ends)
    {
        Console.WriteLine("=== Программа запущена ===");

        // ==========================================
        // ЭТАП 1: Синхронный запуск (new Task)
        // ==========================================
        // ЗАДАНИЕ: Добавьте чтение конфига
        Task readConfig = new Task(() =>
        {
            Console.WriteLine("Загрузка текущей конфигурации...");
            Thread.Sleep(500);
            Console.WriteLine("Текущая конфигурация: ... ");

        });
        // ЗАДАНИЕ: Запустите configTask СИНХРОННО
        readConfig.RunSynchronously();

        Console.WriteLine("Main: Продолжаем работу сразу после конфига.\n");


        // ==========================================
        // ЭТАП 2: Фабрика задач и проверка свойств
        // ==========================================
        // ЗАДАНИЕ: Создайте и запустите задачу через Task.Factory.StartNew. 
        // Внутри выведите сообщение "Загрузка логов..." и сделайте задержку 1.5 секунды.
        Task downloadTask = Task.Factory.StartNew(() =>
        {
            Console.WriteLine("Загрузка логов...");
            Thread.Sleep(1500);
            Console.WriteLine("Загрузка логов завершена.");
        });
        // ЗАДАНИЕ: Пока задача выполняется, выводите в консоль точки (анимация загрузки)
        while (!downloadTask.IsCompleted)
        {
            Console.Write(".");
            Thread.Sleep(200);
        }
        Console.WriteLine();

        // ЗАДАНИЕ: Окончательно заблокируйте поток до завершения (на всякий случай)
        /* Ваш код здесь */
        Console.WriteLine($"[Логи] Загрузка завершена. Статус задачи: {downloadTask.Status}\n");


        // ==========================================
        // ЭТАП 3: Task.Run и финальный статус
        // ==========================================
        // ЗАДАНИЕ: Создайте и запустите задачу через Task.Run. Inside: задержка 1 секунда.
        Task analysisTask = /* Ваш код здесь */;

        // ЗАДАНИЕ: Сразу же выведите Id задачи и её статус (должен быть Running)
        Console.WriteLine($"[Анализ] ID задачи: {/* код */}, Статус: {/* код */}");

        // ЗАДАНИЕ: Дождитесь завершения анализа
        /* Ваш код здесь */

        // ЗАДАНИЕ: Выведите финальный статус и проверьте успешность через IsCompletedSuccessfully
        Console.WriteLine($"[Анализ] Завершен! Финальный статус: {/* код */}");
        Console.WriteLine($"[Анализ] Успешно? {/* код */}");

        Console.WriteLine("=== Программа успешно завершена ===");
    }
}

