using System;
using System.Threading;
using System.Threading.Tasks;

class Program
{
    static void Main(string[] Ends)
    {
        Console.WriteLine("=== Программа запущена ===");

        // ==========================================
        // ЭТАП 1: Синхронный запуск (new Task)
        // ==========================================
        // ЗАДАНИЕ: Добавьте чтение конфига с задержкой 1 секунда
        Task readConfig = new Task(() =>
        {
            Console.WriteLine("Загрузка текущей конфигурации...");
            Thread.Sleep(1000);
            Console.WriteLine("Текущая конфигурация: ... ");

        });
        // ЗАДАНИЕ: Запустите configTask СИНХРОННО
        readConfig.RunSynchronously();

        Console.WriteLine("Main: Продолжаем работу сразу после конфига.\n");


        // ==========================================
        // ЭТАП 2: Фабрика задач и проверка свойств
        // ==========================================
        // ЗАДАНИЕ: Создайте и запустите задачу через Task.Factory.StartNew. 
        // Внутри выведите сообщение "Загрузка логов" и сделайте задержку 2 секунды c анимацией загрузки (точками).
        // Внутри добавьте айди текущей задачи и её текущий статус.
        Task downloadTask = Task.Factory.StartNew(() =>
        {
            Console.WriteLine("Загрузка логов");
            {
                for (var i = 0; i < 10; i++)
                {
                    Console.Write(".");
                    Thread.Sleep(200);
                }
            }
        });
        // ЗАДАНИЕ: Окончательно заблокируйте поток до завершения (на всякий случай)
        downloadTask.Wait();
        // Проверьте завершена ли задача
        if (downloadTask.IsCompletedSuccessfully)
        Console.WriteLine("Загрузка логов завершена.");
        // ==========================================
        // ЭТАП 3: Task.Run и финальный статус
        // ==========================================
        // ЗАДАНИЕ: Создайте и запустите задачу через Task.Run. Inside: задержка 1 секунда.
        Task analysisTask = /* Ваш код здесь */;

        // ЗАДАНИЕ: Сразу же выведите Id задачи и её статус (должен быть Running)
        Console.WriteLine($"[Анализ] ID задачи: {/* код */}, Статус: {/* код */}");

        // ЗАДАНИЕ: Дождитесь завершения анализа
        /* Ваш код здесь */

        // ЗАДАНИЕ: Выведите финальный статус и проверьте успешность через IsCompletedSuccessfully
        Console.WriteLine($"[Анализ] Завершен! Финальный статус: {/* код */}");
        Console.WriteLine($"[Анализ] Успешно? {/* код */}");

        Console.WriteLine("=== Программа успешно завершена ===");
    }
}

